rabbitvm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Rabbit VM Implementation</title>
<!-- 2016-03-29 Tue 16:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Maxwell Bernstein" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Rabbit VM Implementation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. VM structure</a></li>
<li><a href="#sec-2">2. Registers</a></li>
<li><a href="#sec-3">3. Instructions</a>
<ul>
<li><a href="#sec-3-1">3.1. Decoding</a></li>
<li><a href="#sec-3-2">3.2. Modes</a></li>
<li><a href="#sec-3-3">3.3. Following mode rules</a></li>
</ul>
</li>
<li><a href="#sec-4">4. VM setup</a>
<ul>
<li><a href="#sec-4-1">4.1. Check CLI arguments</a></li>
<li><a href="#sec-4-2">4.2. Open code file</a></li>
<li><a href="#sec-4-3">4.3. Get size of code file</a></li>
<li><a href="#sec-4-4">4.4. Allocate memory</a></li>
<li><a href="#sec-4-5">4.5. Read code into memory</a></li>
<li><a href="#sec-4-6">4.6. Fetch-decode-execute loop</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">

<pre class="src src-c" id="status_enum">/* Exit/error codes and statuses. */
typedef enum rabbits {
    RB_SUCCESS = 0, RB_FAIL, RB_OVERFLOW, RB_ILLEGAL,
} rabbits;
</pre>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> VM structure</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-c" id="getabc">/* Most instructions have a destination address and two operands. This struct
 * holds those. */
struct abc_s {
    rabbitw *dst, b, c;
};

/* Using the options/modes given by the user, fetch the destination address and
 * operands. */
static struct abc_s getabc(rabbitw *regs, rabbitw *mem, struct unpacked_s i) {
    rabbitw *dst = i.modes.rega_deref ? &amp;mem[regs[i.rega]] : &amp;regs[i.rega];
    rabbitw bval = i.modes.regb_deref ? mem[regs[i.regb]] : regs[i.regb];
    rabbitw cval = i.modes.immediate ? fetch_immediate() : regs[i.regc];
    cval = i.modes.regc_deref ? mem[cval] : cval;
    return (struct abc_s) { .dst = dst, .b = bval, .c = cval };
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c" id="fetch_immediate">#define fetch_immediate() mem[regs[RB_IP]++]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c">#include &lt;stdio.h&gt;
#include &lt;inttypes.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;sys/stat.h&gt;

typedef uint32_t rabbitw;

{{{declarations}}}

int main(int argc, char **argv) {
    {{{check_cli_arguments}}}

    {{{open_code_file}}}

    {{{stat_code_file}}}

    {{{allocate_memory}}}

    {{{read_code_into_memory}}}

    {{{fetch_decode_execute_loop}}}

    return 0;
}

#undef fetch_immediate
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Registers</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-c" id="register_enum">/* Registers available for use. */
typedef enum rabbitr {
    RB_ZERO = 0, RB_R1, RB_R2, RB_R3, RB_R4, RB_R5, RB_R6, RB_R7, RB_R8, RB_R9,
    RB_IP, RB_SP, RB_RET, RB_TMP, RB_FLAGS, RB_NUMREGS,
} rabbitr;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Instructions</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c" id="unpacked_representation">/* Options for operand use. Is space C an immediate value or a register? Should
 * any of spaces A, B, and C be dereferenced? */
struct modes_s {
    uint8_t immediate : 1;
    uint8_t regc_deref : 1;
    uint8_t regb_deref : 1;
    uint8_t rega_deref : 1;
};

/* Holds an unpacked representation of an instruction (sans immediate value, if
 * it has one). */
struct unpacked_s {
    struct modes_s modes;
    uint8_t opcode : 4;
    uint8_t regc : 4;
    uint8_t regb : 4;
    uint8_t rega : 4;
};
</pre>
</div>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Decoding</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-c" id="decode_function">/* Transform the packed representation of an instruction into the unpacked
 * representation. */
struct unpacked_s decode(rabbitw instr) {
    /* Fetch the space modes from the instruction. */
    uint8_t modes = (instr &gt;&gt; 24) &amp; 0xF;

    /* Offsets of the space modes in the mode nibble. */
    static const unsigned char RB_ADDRA = 1U &lt;&lt; 0,
	RB_ADDRB = 1U &lt;&lt; 1,
	RB_ADDRC = 1U &lt;&lt; 2,
	RB_IMMED = 1U &lt;&lt; 3;

    return (struct unpacked_s) {
	.modes = {
	    .immediate = modes &amp; RB_IMMED,
	    .regc_deref = modes &amp; RB_ADDRC,
	    .regb_deref = modes &amp; RB_ADDRB,
	    .rega_deref = modes &amp; RB_ADDRA,
	},
	.opcode = instr &gt;&gt; 28,
	.regc = (instr &gt;&gt; 8) &amp; 0xF,
	.regb = (instr &gt;&gt; 4) &amp; 0xF,
	.rega = instr &amp; 0xF,
    };
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Modes</h3>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Following mode rules</h3>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> VM setup</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Check CLI arguments</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-c" id="check_cli_arguments">if (argc != 2) {
    fprintf(stderr, "Need to pass file to execute.\n");
    return RB_FAIL;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Open code file</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-c" id="open_code_file">char *fn = argv[1];
FILE *fp = fopen(fn, "rb");
if (fp == NULL) {
    fprintf(stderr, "Can't open `%s'.\n", fn);
    return RB_FAIL;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Get size of code file</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-c" id="stat_code_file">/* Get the size of the file so that we can allocate memory for it. */
struct stat st;
if (fstat(fileno(fp), &amp;st) != 0) {
    fprintf(stderr, "Can't stat `%s'.\n", fn);
    fclose(fp);
    return RB_FAIL;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Allocate memory</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-c" id="allocate_memory">/* Allocate memory with program first, stack second. */
size_t stacksize = 1000;
off_t size = st.st_size;
rabbitw *mem = malloc(stacksize + size * sizeof *mem);
if (mem == NULL) {
    fprintf(stderr, "Not enough memory. Could not allocate stack of size"
		    "%zu + program of size %lld.\n", stacksize, size);
    return RB_FAIL;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Read code into memory</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">

<pre class="src src-c" id="read_code_into_memory">/* Read the file into memory. */
size_t i = 0;
rabbitw word;
while (fread(&amp;word, sizeof word, 1, fp) != 0) {
    mem[i++] = word;
}
fclose(fp);
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c" id="instruction_enum">/* Instructions available for use. */
typedef enum rabbiti {
    RB_HALT = 0, RB_MOVE, RB_ADD, RB_SUB, RB_MUL, RB_DIV, RB_SHR, RB_SHL,
    RB_NAND, RB_XOR, RB_BR, RB_BRZ, RB_BRNZ, RB_IN, RB_OUT, RB_NUMINSTRS,
} rabbiti;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Fetch-decode-execute loop</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">

<pre class="src src-c" id="fetch_decode_execute_loop">struct abc_s abc;
rabbitw regs[RB_NUMINSTRS] = { 0 };
regs[RB_SP] = i;

/* Main fetch-decode-execute loop. */
while (1) {
    /* Fetch the current instruction word. */
    rabbitw word = mem[regs[RB_IP]++];

    /* Decode it. */
    struct unpacked_s i = decode(word);

    /* Execute it. */
    switch (i.opcode) {
    case RB_HALT:
	free(mem);
	return RB_SUCCESS;
	break;
    case RB_MOVE: {
	/* Move is special because it has one source instead of two
	 * operands. */
	rabbitw src = i.modes.immediate   ? fetch_immediate()  : regs[i.regc];
	rabbitw *dst = i.modes.regb_deref ? &amp;mem[regs[i.regb]] : &amp;regs[i.regb];
	*dst = i.modes.regc_deref ? mem[src] : src;
	break;
    }
    case RB_ADD:
	abc = getabc(regs, mem, i);
	*abc.dst = abc.b + abc.c;
	break;
    case RB_SUB:
	abc = getabc(regs, mem, i);
	rabbitw res = abc.b - abc.c;
	*abc.dst = res;
	if (res == 0) {
	    /* Set zero flag. */
	    regs[RB_FLAGS] |= 0x2U;
	}
	break;
    case RB_MUL:
	abc = getabc(regs, mem, i);
	*abc.dst = abc.b * abc.c;
	break;
    case RB_DIV:
	abc = getabc(regs, mem, i);
	if (abc.c == 0) {
	    free(mem);
	    return RB_ILLEGAL;
	}

	*abc.dst = abc.b / abc.c;
	break;
    case RB_SHR:
	abc = getabc(regs, mem, i);
	*abc.dst = abc.b &gt;&gt; abc.c;
	break;
    case RB_SHL:
	abc = getabc(regs, mem, i);
	*abc.dst = abc.b &lt;&lt; abc.c;
	break;
    case RB_NAND:
	abc = getabc(regs, mem, i);
	*abc.dst = ~(abc.b &amp; abc.c);
	break;
    case RB_XOR:
	abc = getabc(regs, mem, i);
	*abc.dst = abc.b ^ abc.c;
	break;
    case RB_BR: {
	/* Branch is special because it only has one argument. */
	rabbitw src = i.modes.immediate  ? fetch_immediate() : regs[i.regc];
	regs[RB_IP] = i.modes.regc_deref ? mem[src] : src;
	break;
    }
    case RB_BRZ:
	/* Branch if zero is special because it only has one argument. */
	if ((regs[RB_FLAGS] &amp; 0x2U) == 0) {
	    rabbitw src = i.modes.immediate  ? fetch_immediate() : regs[i.regc];
	    regs[RB_IP] = i.modes.regc_deref ? mem[src] : src;
	}
	break;
    case RB_BRNZ:
	/* Branch not zero is special because it only has one argument. */
	if ((regs[RB_FLAGS] &amp; 0x2U) != 0) {
	    rabbitw src = i.modes.immediate ? fetch_immediate() : regs[i.regc];
	    regs[RB_IP] = i.modes.regc_deref ? mem[src] : src;
	}
	break;
    case RB_IN: {
	/* Input is special because it does not have an argument. */
	rabbitw dst = i.modes.immediate ? fetch_immediate() : regs[i.regc];
	rabbitw *dstp = i.modes.regc_deref ? &amp;mem[regs[i.regc]] : &amp;regs[i.regc];
	*dstp = getchar();
	break;
    }
    case RB_OUT: {
	/* Output is special because it has one argument and no
	 * destination. */
	rabbitw src = i.modes.immediate ? fetch_immediate() : regs[i.regc];
	src = i.modes.regc_deref ? mem[src] : src;
	putchar(src);
	break;
    }
    default:
	free(mem);
	return RB_ILLEGAL;
	break;
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Maxwell Bernstein</p>
<p class="date">Created: 2016-03-29 Tue 16:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
